app/controllers/boards_controller.rb

INSERT INTO "boards" ("title", "user_id", "created_at", "updated_at", "detail") VALUES (?, ?, ?, ?, ?)  [["title", "todoアプリ作成用のタスク管理ボード"], ["user_id", 5], ["created_at", "2022-02-22 16:55:11.872238"], ["updated_at", "2022-02-22 16:55:11.872238"], ["detail", "todoアプリ作成用のタスク管理ボード"]]
---
  def create
    title = params[:board][:title]
    detail = params[:board][:detail]
    @board = Board.create(title:title, user_id:session[:user_id],detail: detail)

SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = ?  [["user_id", 6]]
---
  def board_top
    if session[:board_id].present?
      session[:board_id] = nil
    end
    @user_boards = Board.where(user_id:session[:user_id])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "boards" SET "title" = ?, "updated_at" = ? WHERE "boards"."id" = ?  [["title", "test board edit"], ["updated_at", "2022-02-21 17:18:19.140722"], ["id", 1]]
---
  def update
    @board = Board.find(params[:id])
    @board.update(board_params)

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 11]]
---
  def destroy
     @board = Board.find(params[:id])
     @board.destroy