app/controllers/home_controller.rb

  def state
     @task = Task.find(params[:id])

     if @task.state == "未実行"
       @task.state = "実行中"
       @task.save
       redirect_to top_path
     elsif @task.state == "実行中"
       @task.state = "実行済み"
       @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "実行済み"], ["updated_at", "2022-02-12 15:04:14.111331"], ["id", 28]]
UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "実行中"], ["updated_at", "2022-03-01 14:15:10.074397"], ["id", 45]]

  def detail
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]