app/controllers/sessions_controller.rb

  def signup
    user = User.create(email:params[:email],password:params[:password],password_confirmation:params[:password])
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "aoyama"], ["password_digest", "$2a$12$zPbPzltdqtuNmhQ5IkDI3umkAv6.vD31WnwACvPRcH8GmeWz5pQDC"], ["created_at", "2022-02-04 19:37:06.938116"], ["updated_at", "2022-02-04 19:37:06.938116"]]