app/controllers/tasks_controller.rb

  def show
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    title = params[:task][:title]
    limit_date = params[:task][:limit_date]
    @task = Task.create(title:title, limit_date:limit_date, user_id:session[:user_id], state:"未実行")
---
INSERT INTO "tasks" ("user_id", "state", "title", "limit_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["state", "未実行"], ["title", "テストタスク"], ["limit_date", "2022-02-09"], ["created_at", "2022-02-07 17:42:19.156715"], ["updated_at", "2022-02-07 17:42:19.156715"]]

    def update
      @task = Task.find(params[:id])
      @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "編集画面の修正part2"], ["updated_at", "2022-02-18 14:58:08.301120"], ["id", 41]]